# 2. Напишіть функцію square, яка приймає 1 аргумент, сторону
# квадрата, і повертає 3 значення (за допомогою кортежу):
# периметр квадрата, площа квадрата та діагональ квадрата.
import math
def square(a):
    P = a + a + a + a
    print(f"Периметр квадрата -> {P}")
    S = pow(a, 2)
    print(f"Площадь квадрата -> {S}")
    D = math.sqrt(2) * a
    print(f"Диагональ квадрата -> {D}")
    result=(P, S, D)
    print("Кортеж со значениями P, S и D:", result)
    print(type(result))

if __name__ == '__main__':
    a = int(input("Введите значение -> "))
    square(a)
